app/Models/TicketModel.php

SELECT *
FROM `ticket`
JOIN `payment` ON `ticket`.`Pay_ID` = `payment`.`Pay_ID`
JOIN `reservation` ON `payment`.`Reserve_ID` = `reservation`.`Reserve_ID`
JOIN `station` ON `station`.`Station_ID` = `reservation`.`Station_Start`
WHERE `reservation`.`User_ID` = 4 and `payment`.`Confirm` = 'success'
ORDER BY `Tick_ID` DESC
---
  public function get_history($user_ID)
  {
    $where_sql = "reservation.User_ID = $user_ID and payment.Confirm = 'success'";
    return $this->db
      ->table('ticket')
      ->join('payment', 'ticket.Pay_ID = payment.Pay_ID')
      ->join('reservation', 'payment.Reserve_ID = reservation.Reserve_ID ')
      ->join('station', 'station.Station_ID = reservation.Station_Start')
      ->where($where_sql)
      ->orderby('Tick_ID', 'DESC')
      ->get()
      ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `ticket`
JOIN `payment` ON `payment`.`Pay_ID` = `ticket`.`Pay_ID`
WHERE `ticket`.`Pay_ID` = 5 AND `payment`.`User_ID` = 4
---
  public function check_ticket($Pay_ID)
  {
    $session = session();
    $ses_userid = $session->get('ses_id');
    $where_sql = "ticket.Pay_ID = $Pay_ID AND payment.User_ID = $ses_userid";
    $data = $this->db
      ->table('ticket')
      ->join('payment', 'payment.Pay_ID = ticket.Pay_ID')
      ->where($where_sql)
      ->countAllResults();